HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxCan_bf.h
/** \brief Offset for Ifx_CAN_N_ACCENNODE0_Bits.EN30 */
#define IFX_CAN_N_ACCENNODE0_EN30_OFF (30u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0_Bits.EN31 */
#define IFX_CAN_N_ACCENNODE0_EN31_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0_Bits.EN31 */
#define IFX_CAN_N_ACCENNODE0_EN31_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0_Bits.EN31 */
#define IFX_CAN_N_ACCENNODE0_EN31_OFF (31u)

/** \brief Length for Ifx_CAN_N_STARTADR_Bits.START */
#define IFX_CAN_N_STARTADR_START_LEN (14u)

/** \brief Mask for Ifx_CAN_N_STARTADR_Bits.START */
#define IFX_CAN_N_STARTADR_START_MSK (0x3fffu)

/** \brief Offset for Ifx_CAN_N_STARTADR_Bits.START */
#define IFX_CAN_N_STARTADR_START_OFF (2u)

/** \brief Length for Ifx_CAN_N_ENDADR_Bits.END */
#define IFX_CAN_N_ENDADR_END_LEN (14u)

/** \brief Mask for Ifx_CAN_N_ENDADR_Bits.END */
#define IFX_CAN_N_ENDADR_END_MSK (0x3fffu)

/** \brief Offset for Ifx_CAN_N_ENDADR_Bits.END */
#define IFX_CAN_N_ENDADR_END_OFF (2u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.REINT */
#define IFX_CAN_N_ISREG_REINT_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.REINT */
#define IFX_CAN_N_ISREG_REINT_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.REINT */
#define IFX_CAN_N_ISREG_REINT_OFF (0u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.RxF1F */
#define IFX_CAN_N_ISREG_RXF1F_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.RxF1F */
#define IFX_CAN_N_ISREG_RXF1F_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.RxF1F */
#define IFX_CAN_N_ISREG_RXF1F_OFF (1u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.RxF0F */
#define IFX_CAN_N_ISREG_RXF0F_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.RxF0F */
#define IFX_CAN_N_ISREG_RXF0F_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.RxF0F */
#define IFX_CAN_N_ISREG_RXF0F_OFF (2u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.RxF1N */
#define IFX_CAN_N_ISREG_RXF1N_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.RxF1N */
#define IFX_CAN_N_ISREG_RXF1N_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.RxF1N */
#define IFX_CAN_N_ISREG_RXF1N_OFF (3u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.RxF0N */
#define IFX_CAN_N_ISREG_RXF0N_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.RxF0N */
#define IFX_CAN_N_ISREG_RXF0N_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.RxF0N */
#define IFX_CAN_N_ISREG_RXF0N_OFF (4u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.RETI */
#define IFX_CAN_N_ISREG_RETI_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.RETI */
#define IFX_CAN_N_ISREG_RETI_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.RETI */
#define IFX_CAN_N_ISREG_RETI_OFF (5u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.TRAQ */
#define IFX_CAN_N_ISREG_TRAQ_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.TRAQ */
#define IFX_CAN_N_ISREG_TRAQ_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.TRAQ */
#define IFX_CAN_N_ISREG_TRAQ_OFF (6u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.TRACO */
#define IFX_CAN_N_ISREG_TRACO_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.TRACO */
#define IFX_CAN_N_ISREG_TRACO_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.TRACO */
#define IFX_CAN_N_ISREG_TRACO_OFF (7u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.TEFIFO */
#define IFX_CAN_N_ISREG_TEFIFO_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.TEFIFO */
#define IFX_CAN_N_ISREG_TEFIFO_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.TEFIFO */
#define IFX_CAN_N_ISREG_TEFIFO_OFF (8u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.HPE */
#define IFX_CAN_N_ISREG_HPE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.HPE */
#define IFX_CAN_N_ISREG_HPE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.HPE */
#define IFX_CAN_N_ISREG_HPE_OFF (9u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.WATI */
#define IFX_CAN_N_ISREG_WATI_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.WATI */
#define IFX_CAN_N_ISREG_WATI_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.WATI */
#define IFX_CAN_N_ISREG_WATI_OFF (10u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.ALRT */
#define IFX_CAN_N_ISREG_ALRT_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.ALRT */
#define IFX_CAN_N_ISREG_ALRT_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.ALRT */
#define IFX_CAN_N_ISREG_ALRT_OFF (11u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.MOER */
#define IFX_CAN_N_ISREG_MOER_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.MOER */
#define IFX_CAN_N_ISREG_MOER_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.MOER */
#define IFX_CAN_N_ISREG_MOER_OFF (12u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.SAFE */
#define IFX_CAN_N_ISREG_SAFE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.SAFE */
#define IFX_CAN_N_ISREG_SAFE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.SAFE */
#define IFX_CAN_N_ISREG_SAFE_OFF (13u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.BOFF */
#define IFX_CAN_N_ISREG_BOFF_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.BOFF */
#define IFX_CAN_N_ISREG_BOFF_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.BOFF */
#define IFX_CAN_N_ISREG_BOFF_OFF (14u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.LOI */
#define IFX_CAN_N_ISREG_LOI_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.LOI */
#define IFX_CAN_N_ISREG_LOI_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.LOI */
#define IFX_CAN_N_ISREG_LOI_OFF (15u)

/** \brief Length for Ifx_CAN_N_GRINT1_Bits.TEFIFO */
#define IFX_CAN_N_GRINT1_TEFIFO_LEN (4u)

/** \brief Mask for Ifx_CAN_N_GRINT1_Bits.TEFIFO */
#define IFX_CAN_N_GRINT1_TEFIFO_MSK (0xfu)

/** \brief Offset for Ifx_CAN_N_GRINT1_Bits.TEFIFO */
#define IFX_CAN_N_GRINT1_TEFIFO_OFF (0u)

/** \brief Length for Ifx_CAN_N_GRINT1_Bits.HPE */
#define IFX_CAN_N_GRINT1_HPE_LEN (4u)

/** \brief Mask for Ifx_CAN_N_GRINT1_Bits.HPE */
#define IFX_CAN_N_GRINT1_HPE_MSK (0xfu)

/** \brief Offset for Ifx_CAN_N_GRINT1_Bits.HPE */
#define IFX_CAN_N_GRINT1_HPE_OFF (4u)

/** \brief Length for Ifx_CAN_N_GRINT1_Bits.WATI */
#define IFX_CAN_N_GRINT1_WATI_LEN (4u)

/** \brief Mask for Ifx_CAN_N_GRINT1_Bits.WATI */
#define IFX_CAN_N_GRINT1_WATI_MSK (0xfu)

/** \brief Offset for Ifx_CAN_N_GRINT1_Bits.WATI */
#define IFX_CAN_N_GRINT1_WATI_OFF (8u)

/** \brief Length for Ifx_CAN_N_GRINT1_Bits.ALRT */
#define IFX_CAN_N_GRINT1_ALRT_LEN (4u)

/** \brief Mask for Ifx_CAN_N_GRINT1_Bits.ALRT */
#define IFX_CAN_N_GRINT1_ALRT_MSK (0xfu)

/** \brief Offset for Ifx_CAN_N_GRINT1_Bits.ALRT */
#define IFX_CAN_N_GRINT1_ALRT_OFF (12u)

/** \brief Length for Ifx_CAN_N_GRINT1_Bits.MOER */
#define IFX_CAN_N_GRINT1_MOER_LEN (4u)

/** \brief Mask for Ifx_CAN_N_GRINT1_Bits.MOER */
#define IFX_CAN_N_GRINT1_MOER_MSK (0xfu)

/** \brief Offset for Ifx_CAN_N_GRINT1_Bits.MOER */
#define IFX_CAN_N_GRINT1_MOER_OFF (16u)

/** \brief Length for Ifx_CAN_N_GRINT1_Bits.SAFE */
#define IFX_CAN_N_GRINT1_SAFE_LEN (4u)

/** \brief Mask for Ifx_CAN_N_GRINT1_Bits.SAFE */
#define IFX_CAN_N_GRINT1_SAFE_MSK (0xfu)

