HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxCan_bf.h
/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND12 */
#define IFX_CAN_N_NDAT1_ND12_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND12 */
#define IFX_CAN_N_NDAT1_ND12_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND12 */
#define IFX_CAN_N_NDAT1_ND12_OFF (12u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND13 */
#define IFX_CAN_N_NDAT1_ND13_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND13 */
#define IFX_CAN_N_NDAT1_ND13_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND13 */
#define IFX_CAN_N_NDAT1_ND13_OFF (13u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND14 */
#define IFX_CAN_N_NDAT1_ND14_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND14 */
#define IFX_CAN_N_NDAT1_ND14_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND14 */
#define IFX_CAN_N_NDAT1_ND14_OFF (14u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND15 */
#define IFX_CAN_N_NDAT1_ND15_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND15 */
#define IFX_CAN_N_NDAT1_ND15_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND15 */
#define IFX_CAN_N_NDAT1_ND15_OFF (15u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND16 */
#define IFX_CAN_N_NDAT1_ND16_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND16 */
#define IFX_CAN_N_NDAT1_ND16_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND16 */
#define IFX_CAN_N_NDAT1_ND16_OFF (16u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND17 */
#define IFX_CAN_N_NDAT1_ND17_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND17 */
#define IFX_CAN_N_NDAT1_ND17_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND17 */
#define IFX_CAN_N_NDAT1_ND17_OFF (17u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND18 */
#define IFX_CAN_N_NDAT1_ND18_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND18 */
#define IFX_CAN_N_NDAT1_ND18_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND18 */
#define IFX_CAN_N_NDAT1_ND18_OFF (18u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND19 */
#define IFX_CAN_N_NDAT1_ND19_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND19 */
#define IFX_CAN_N_NDAT1_ND19_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND19 */
#define IFX_CAN_N_NDAT1_ND19_OFF (19u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND20 */
#define IFX_CAN_N_NDAT1_ND20_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND20 */
#define IFX_CAN_N_NDAT1_ND20_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND20 */
#define IFX_CAN_N_NDAT1_ND20_OFF (20u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND21 */
#define IFX_CAN_N_NDAT1_ND21_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND21 */
#define IFX_CAN_N_NDAT1_ND21_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND21 */
#define IFX_CAN_N_NDAT1_ND21_OFF (21u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND22 */
#define IFX_CAN_N_NDAT1_ND22_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND22 */
#define IFX_CAN_N_NDAT1_ND22_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND22 */
#define IFX_CAN_N_NDAT1_ND22_OFF (22u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND23 */
#define IFX_CAN_N_NDAT1_ND23_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND23 */
#define IFX_CAN_N_NDAT1_ND23_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND23 */
#define IFX_CAN_N_NDAT1_ND23_OFF (23u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND24 */
#define IFX_CAN_N_NDAT1_ND24_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND24 */
#define IFX_CAN_N_NDAT1_ND24_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND24 */
#define IFX_CAN_N_NDAT1_ND24_OFF (24u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND25 */
#define IFX_CAN_N_NDAT1_ND25_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND25 */
#define IFX_CAN_N_NDAT1_ND25_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND25 */
#define IFX_CAN_N_NDAT1_ND25_OFF (25u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND26 */
#define IFX_CAN_N_NDAT1_ND26_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND26 */
#define IFX_CAN_N_NDAT1_ND26_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND26 */
#define IFX_CAN_N_NDAT1_ND26_OFF (26u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND27 */
#define IFX_CAN_N_NDAT1_ND27_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND27 */
#define IFX_CAN_N_NDAT1_ND27_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND27 */
#define IFX_CAN_N_NDAT1_ND27_OFF (27u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND28 */
#define IFX_CAN_N_NDAT1_ND28_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND28 */
#define IFX_CAN_N_NDAT1_ND28_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND28 */
#define IFX_CAN_N_NDAT1_ND28_OFF (28u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND29 */
#define IFX_CAN_N_NDAT1_ND29_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND29 */
#define IFX_CAN_N_NDAT1_ND29_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND29 */
#define IFX_CAN_N_NDAT1_ND29_OFF (29u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND30 */
#define IFX_CAN_N_NDAT1_ND30_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND30 */
#define IFX_CAN_N_NDAT1_ND30_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND30 */
#define IFX_CAN_N_NDAT1_ND30_OFF (30u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND31 */
#define IFX_CAN_N_NDAT1_ND31_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND31 */
#define IFX_CAN_N_NDAT1_ND31_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND31 */
#define IFX_CAN_N_NDAT1_ND31_OFF (31u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND32 */
#define IFX_CAN_N_NDAT2_ND32_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND32 */
#define IFX_CAN_N_NDAT2_ND32_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND32 */
#define IFX_CAN_N_NDAT2_ND32_OFF (0u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND33 */
#define IFX_CAN_N_NDAT2_ND33_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND33 */
#define IFX_CAN_N_NDAT2_ND33_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND33 */
#define IFX_CAN_N_NDAT2_ND33_OFF (1u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND34 */
#define IFX_CAN_N_NDAT2_ND34_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND34 */
#define IFX_CAN_N_NDAT2_ND34_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND34 */
#define IFX_CAN_N_NDAT2_ND34_OFF (2u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND35 */
#define IFX_CAN_N_NDAT2_ND35_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND35 */
#define IFX_CAN_N_NDAT2_ND35_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND35 */
#define IFX_CAN_N_NDAT2_ND35_OFF (3u)

