HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxCan_bf.h
/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP29 */
#define IFX_CAN_N_TX_BRP_TRP29_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP29 */
#define IFX_CAN_N_TX_BRP_TRP29_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP29 */
#define IFX_CAN_N_TX_BRP_TRP29_OFF (29u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP30 */
#define IFX_CAN_N_TX_BRP_TRP30_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP30 */
#define IFX_CAN_N_TX_BRP_TRP30_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP30 */
#define IFX_CAN_N_TX_BRP_TRP30_OFF (30u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP31 */
#define IFX_CAN_N_TX_BRP_TRP31_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP31 */
#define IFX_CAN_N_TX_BRP_TRP31_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP31 */
#define IFX_CAN_N_TX_BRP_TRP31_OFF (31u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR0 */
#define IFX_CAN_N_TX_BAR_AR0_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR0 */
#define IFX_CAN_N_TX_BAR_AR0_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR0 */
#define IFX_CAN_N_TX_BAR_AR0_OFF (0u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR1 */
#define IFX_CAN_N_TX_BAR_AR1_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR1 */
#define IFX_CAN_N_TX_BAR_AR1_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR1 */
#define IFX_CAN_N_TX_BAR_AR1_OFF (1u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR2 */
#define IFX_CAN_N_TX_BAR_AR2_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR2 */
#define IFX_CAN_N_TX_BAR_AR2_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR2 */
#define IFX_CAN_N_TX_BAR_AR2_OFF (2u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR3 */
#define IFX_CAN_N_TX_BAR_AR3_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR3 */
#define IFX_CAN_N_TX_BAR_AR3_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR3 */
#define IFX_CAN_N_TX_BAR_AR3_OFF (3u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR4 */
#define IFX_CAN_N_TX_BAR_AR4_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR4 */
#define IFX_CAN_N_TX_BAR_AR4_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR4 */
#define IFX_CAN_N_TX_BAR_AR4_OFF (4u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR5 */
#define IFX_CAN_N_TX_BAR_AR5_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR5 */
#define IFX_CAN_N_TX_BAR_AR5_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR5 */
#define IFX_CAN_N_TX_BAR_AR5_OFF (5u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR6 */
#define IFX_CAN_N_TX_BAR_AR6_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR6 */
#define IFX_CAN_N_TX_BAR_AR6_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR6 */
#define IFX_CAN_N_TX_BAR_AR6_OFF (6u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR7 */
#define IFX_CAN_N_TX_BAR_AR7_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR7 */
#define IFX_CAN_N_TX_BAR_AR7_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR7 */
#define IFX_CAN_N_TX_BAR_AR7_OFF (7u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR8 */
#define IFX_CAN_N_TX_BAR_AR8_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR8 */
#define IFX_CAN_N_TX_BAR_AR8_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR8 */
#define IFX_CAN_N_TX_BAR_AR8_OFF (8u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR9 */
#define IFX_CAN_N_TX_BAR_AR9_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR9 */
#define IFX_CAN_N_TX_BAR_AR9_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR9 */
#define IFX_CAN_N_TX_BAR_AR9_OFF (9u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR10 */
#define IFX_CAN_N_TX_BAR_AR10_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR10 */
#define IFX_CAN_N_TX_BAR_AR10_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR10 */
#define IFX_CAN_N_TX_BAR_AR10_OFF (10u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR11 */
#define IFX_CAN_N_TX_BAR_AR11_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR11 */
#define IFX_CAN_N_TX_BAR_AR11_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR11 */
#define IFX_CAN_N_TX_BAR_AR11_OFF (11u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR12 */
#define IFX_CAN_N_TX_BAR_AR12_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR12 */
#define IFX_CAN_N_TX_BAR_AR12_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR12 */
#define IFX_CAN_N_TX_BAR_AR12_OFF (12u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR13 */
#define IFX_CAN_N_TX_BAR_AR13_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR13 */
#define IFX_CAN_N_TX_BAR_AR13_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR13 */
#define IFX_CAN_N_TX_BAR_AR13_OFF (13u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR14 */
#define IFX_CAN_N_TX_BAR_AR14_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR14 */
#define IFX_CAN_N_TX_BAR_AR14_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR14 */
#define IFX_CAN_N_TX_BAR_AR14_OFF (14u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR15 */
#define IFX_CAN_N_TX_BAR_AR15_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR15 */
#define IFX_CAN_N_TX_BAR_AR15_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR15 */
#define IFX_CAN_N_TX_BAR_AR15_OFF (15u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR16 */
#define IFX_CAN_N_TX_BAR_AR16_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR16 */
#define IFX_CAN_N_TX_BAR_AR16_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR16 */
#define IFX_CAN_N_TX_BAR_AR16_OFF (16u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR17 */
#define IFX_CAN_N_TX_BAR_AR17_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR17 */
#define IFX_CAN_N_TX_BAR_AR17_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR17 */
#define IFX_CAN_N_TX_BAR_AR17_OFF (17u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR18 */
#define IFX_CAN_N_TX_BAR_AR18_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR18 */
#define IFX_CAN_N_TX_BAR_AR18_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR18 */
#define IFX_CAN_N_TX_BAR_AR18_OFF (18u)

